In [2]:
import pandas as pd
import os

print("Pandas imported successfully.")

Pandas imported successfully.

# loading the dataset

In [4]:
# file path
customer_file = os.path.join('data', 'task_DE_new_customers.csv')

# pandas dataframe
customers_df = pd.read_csv(customer_file)

In [5]:
customers_df.shape

(5, 4)

In [6]:
customers_df.size

20

In [7]:
customers_df.columns

Index(['customer_id', 'customer_name', 'mobile_number', 'region'], dtype='object')

In [8]:
customers_df.sample

<bound method NDFrame.sample of   customer_id customer_name  mobile_number   region
0    CUST-001   Aarav Mehta     9123456781     West
1    CUST-002   Neha Sharma     9123456782    North
2    CUST-003   Rohan Gupta     9123456783    South
3    CUST-004    Priya Iyer     9123456784     West
4    CUST-005   Kabir Singh     9123456785  Central>

In [11]:
customers_df.isnull().sum()

customer_id      0
customer_name    0
mobile_number    0
region           0
dtype: int64

In [12]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    5 non-null      object
 1   customer_name  5 non-null      object
 2   mobile_number  5 non-null      int64
 3   region         5 non-null      object
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes

# xml dataset

In [14]:
order_file=os.path.join('data', 'task_DE_new_orders.xml')
# into dataframes
order_df=pd.read_xml(order_file)

In [16]:
order_df.sample(5)

,order_id,mobile_number,order_date_time,sku_id,sku_count,total_amount
6,ORD-2025-0003,9123456782,2025-09-30T18:45:55,SKU-1003,4,8930
8,ORD-2025-0003,9123456782,2025-09-30T18:45:55,SKU-1010,2,8930
9,ORD-2025-0003,9123456782,2025-09-30T18:45:55,SKU-1012,1,8930
4,ORD-2025-0002,9123456781,2025-11-01T14:22:10,SKU-1007,2,5299
1,ORD-2025-0001,9123456781,2025-10-12T09:15:32,SKU-1004,1,7450

In [17]:
print("\n--- All Order Items Info (Types & Nulls) ---")
order_df.info()

--- All Order Items Info (Types & Nulls) ---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         10 non-null     object
 1   mobile_number    10 non-null     int64
 2   order_date_time  10 non-null     object
 3   sku_id           10 non-null     object
 4   sku_count        10 non-null     int64
 5   total_amount     10 non-null     int64
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes

In [18]:
order_df.isnull().sum()

order_id           0
mobile_number      0
order_date_time    0
sku_id             0
sku_count          0
total_amount       0
dtype: int64

In [19]:
order_df.shape

(10, 6)

In [20]:
order_df.columns

Index(['order_id', 'mobile_number', 'order_date_time', 'sku_id', 'sku_count',
       'total_amount'],
      dtype='object')

## since the two file didn't share the customer_id but they have commonly only the mobile number

# which is only way to link the order --> cutomer  which is the join key  for the regional revenue

In [21]:
order_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         10 non-null     object
 1   mobile_number    10 non-null     int64
 2   order_date_time  10 non-null     object
 3   sku_id           10 non-null     object
 4   sku_count        10 non-null     int64
 5   total_amount     10 non-null     int64
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes

In [22]:
order_df.head(10)

,order_id,mobile_number,order_date_time,sku_id,sku_count,total_amount
0,ORD-2025-0001,9123456781,2025-10-12T09:15:32,SKU-1001,2,7450
1,ORD-2025-0001,9123456781,2025-10-12T09:15:32,SKU-1004,1,7450
2,ORD-2025-0001,9123456781,2025-10-12T09:15:32,SKU-1010,3,7450
3,ORD-2025-0002,9123456781,2025-11-01T14:22:10,SKU-1002,1,5299
4,ORD-2025-0002,9123456781,2025-11-01T14:22:10,SKU-1007,2,5299
5,ORD-2025-0002,9123456781,2025-11-01T14:22:10,SKU-1011,1,5299
6,ORD-2025-0003,9123456782,2025-09-30T18:45:55,SKU-1003,4,8930
7,ORD-2025-0003,9123456782,2025-09-30T18:45:55,SKU-1008,1,8930
8,ORD-2025-0003,9123456782,2025-09-30T18:45:55,SKU-1010,2,8930
9,ORD-2025-0003,9123456782,2025-09-30T18:45:55,SKU-1012,1,8930

# by the above dataset same mobile numebre multiple repeated and also the cost is varies so we need to check the order_id where it duplicate or not becuase 1,2,3 rows have same cost

# Preprocessing - Handling the Duplicate Orders

In [23]:
# We select only the columns that define a unique order
# and drop all duplicate rows
unique_orders_df = order_df[[
    'order_id', 
    'mobile_number', 
    'order_date_time', 
    'total_amount'
]].drop_duplicates()

In [24]:

print("--- Unique Orders (First 5 Rows) ---")
display(unique_orders_df.head())

print(f"Went from {len(order_df)} total items to {len(unique_orders_df)} unique orders.")

--- Unique Orders (First 5 Rows) ---

        order_id  mobile_number      order_date_time  total_amount
0  ORD-2025-0001     9123456781  2025-10-12T09:15:32          7450
3  ORD-2025-0002     9123456781  2025-11-01T14:22:10          5299
6  ORD-2025-0003     9123456782  2025-09-30T18:45:55          8930

Went from 10 total items to 3 unique orders.

# preprocessing - Cleaning Data Types

In [25]:
# 1. Convert the date column from text (object) to a real datetime
unique_orders_df['order_date_time'] = pd.to_datetime(unique_orders_df['order_date_time'])

# 2. Convert total_amount to a number (it's good practice)
unique_orders_df['total_amount'] = pd.to_numeric(unique_orders_df['total_amount'])


print("--- Cleaned Data Info (Note the Dtypes) ---")
unique_orders_df.info()

--- Cleaned Data Info (Note the Dtypes) ---
<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 6
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         3 non-null      object
 1   mobile_number    3 non-null      int64
 2   order_date_time  3 non-null      datetime64[ns]
 3   total_amount     3 non-null      int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 120.0+ bytes

In [26]:
#finally let join the two dataset in order to get the region for each order they have common column is mobilenumber

In [30]:
unique_orders_df

        order_id  mobile_number     order_date_time  total_amount
0  ORD-2025-0001     9123456781 2025-10-12 09:15:32          7450
3  ORD-2025-0002     9123456781 2025-11-01 14:22:10          5299
6  ORD-2025-0003     9123456782 2025-09-30 18:45:55          8930

In [31]:
customers_df     #  "right" table

  customer_id customer_name  mobile_number   region
0    CUST-001   Aarav Mehta     9123456781     West
1    CUST-002   Neha Sharma     9123456782    North
2    CUST-003   Rohan Gupta     9123456783    South
3    CUST-004    Priya Iyer     9123456784     West
4    CUST-005   Kabir Singh     9123456785  Central

In [27]:
# This is the "join"
merged_df = pd.merge(
    unique_orders_df,   #  "left" table
    customers_df,       #  "right" table
    on='mobile_number', #  "key" to link them
    how='left'          # 'left' means "keep all orders, even if a customer is missing"
)

print("--- Fully Merged & Cleaned Data (First 5 Rows) ---")
display(merged_df.head())

--- Fully Merged & Cleaned Data (First 5 Rows) ---

,order_id,mobile_number,order_date_time,total_amount,customer_id,customer_name,region
0,ORD-2025-0001,9123456781,2025-10-12 09:15:32,7450,CUST-001,Aarav Mehta,West
1,ORD-2025-0002,9123456781,2025-11-01 14:22:10,5299,CUST-001,Aarav Mehta,West
2,ORD-2025-0003,9123456782,2025-09-30 18:45:55,8930,CUST-002,Neha Sharma,North

In [28]:
# regional Revenue

In [29]:

print("KPI 3: Regional Revenue")

# 1. Group the table by the 'region' column
# 2. Select the 'total_amount' column
# 3. Sum() it all up
regional_revenue = merged_df.groupby('region')['total_amount'].sum().reset_index()

display(regional_revenue.sort_values(by='total_amount', ascending=False))

KPI 3: Regional Revenue

  region  total_amount
1   West         12749
0  North          8930